{
  "backend/main.mo": "Motoko backend defining user profiles and goal CRUD operations with access control checks and per-user goal storage.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to related files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON mapping of frontend file paths to short descriptive summaries for documentation or build tooling.",
  "frontend/index.css": "Global Tailwind CSS setup defining OKLCH color variables and dark mode theme tokens.",
  "frontend/index.html": "HTML entry point mounting the React app and loading the main TypeScript bundle.",
  "frontend/src/App.tsx": "Main app router setup with authentication gating, layout wrapper, and routes for goals, create, detail, stats, and settings pages.",
  "frontend/src/components/app/AppNav.tsx": "Authenticated navigation bar listing links to My Goals, New Goal, Stats, and Settings with active-route styling.",
  "frontend/src/components/app/AppShell.tsx": "Page layout component providing header with logo, navigation, auth controls, main content area, and footer.",
  "frontend/src/components/auth/AuthControls.tsx": "Login/logout control component integrating Internet Identity with loading states and profile display.",
  "frontend/src/components/goals/GoalCard.tsx": "UI card component rendering a goal’s title, status, description, progress bar, and optional target date with navigation to detail view.",
  "frontend/src/components/goals/GoalForm.tsx": "Form component for creating and editing goals with validation, state management, and submit handling.",
  "frontend/src/components/profile/ProfileSetupModal.tsx": "Modal prompting users to enter and save their name using a profile mutation.",
  "frontend/src/components/state/EmptyGoalsState.tsx": "Empty state view encouraging users to create their first goal with a navigation button.",
  "frontend/src/components/state/LoadingState.tsx": "Skeleton-based loading components for list and detail goal views.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages the backend actor based on Internet Identity and refreshes dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and logic for loading, storing, and managing Internet Identity authentication.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating user profiles and goals via the backend actor.",
  "frontend/src/index.css": "Tailwind setup defining light and dark mode color palettes and base styling variables.",
  "frontend/src/lib/goals/types.ts": "Helpers for mapping goal status values to labels and UI color variants.",
  "frontend/src/lib/goals/validation.ts": "Validation functions for goal titles and progress values.",
  "frontend/src/lib/time.ts": "Utility functions for converting, formatting, and displaying time values from backend timestamps.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and an InternetIdentityProvider before rendering App.",
  "frontend/src/pages/CreateGoalPage.tsx": "Renders a form to create a new goal and submits it through useCreateGoal before navigating home.",
  "frontend/src/pages/GoalDetailPage.tsx": "Fetches, updates, and deletes an individual goal, showing loading/error states and a form for editing.",
  "frontend/src/pages/GoalsDashboardPage.tsx": "Displays all goals with filter controls and handles loading, error, and empty states.",
  "frontend/src/pages/SettingsPage.tsx": "Loads and edits the user profile, validating and saving the display name with visual feedback.",
  "frontend/src/pages/StatsPage.tsx": "Calculates and displays goal statistics including counts and average progress, with loading and error handling.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, persisting, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, extended theme colors, fonts, layouts, and animations using multiple plugins.",
  "project_state.json": "Defines the project’s state including features, new requests, metadata, and configuration for a stats and settings page project."
}