{
  "backend/main.mo": "Motoko backend managing user profiles and CRUD operations for user goals with access control enforcement and per-user goal storage.",
  "feature_evidence.json": "Feature evidence report mapping app modifications to affected files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of key frontend components, pages, hooks, and utilities.",
  "frontend/index.css": "Global Tailwind-based styles defining color tokens, themes, and shared base styling for light and dark modes.",
  "frontend/index.html": "Basic HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React app entry defining authentication flow, layout, and all primary routes using TanStack Router.",
  "frontend/src/components/app/AppBottomNav.tsx": "Mobile bottom navigation bar component listing Home, Settings, Profile, Stats, and Averages links.",
  "frontend/src/components/app/AppNav.tsx": "Desktop navigation bar with links to goals, creation, stats, and settings, highlighting active routes.",
  "frontend/src/components/app/AppShell.tsx": "Application shell providing header, navigation, footer, and conditional mobile bottom nav around page content.",
  "frontend/src/components/auth/AuthControls.tsx": "Sign-in/sign-out UI using Internet Identity with loading states and profile display for authenticated users.",
  "frontend/src/components/goals/AddGoalButton.tsx": "Floating button that navigates to the goal creation page.",
  "frontend/src/components/goals/GoalCard.tsx": "Displays a goal with progress, swipe-to-complete, and navigation to its detail page.",
  "frontend/src/components/goals/GoalForm.tsx": "Form for creating or editing a goal with validation and submission handling.",
  "frontend/src/components/profile/ProfileSetupModal.tsx": "Modal prompting the user to enter and save their profile name.",
  "frontend/src/components/state/EmptyGoalsState.tsx": "Empty state UI encouraging the user to create their first goal.",
  "frontend/src/components/state/LoadingState.tsx": "Shows skeleton loaders for goal lists and goal detail views.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance tied to the user's identity and refreshes dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, loading, login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating user profiles and goals through the backend actor.",
  "frontend/src/index.css": "Sets up Tailwind layers and defines extensive light/dark CSS variable themes with base styling.",
  "frontend/src/lib/goals/types.ts": "Provides helpers mapping goal statuses to labels and UI colors, plus a constant list of statuses.",
  "frontend/src/lib/goals/validation.ts": "Contains validation functions for goal title and progress constraints.",
  "frontend/src/lib/time.ts": "Utility functions for converting, formatting, and displaying time values stored as nanoseconds.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AveragesPage.tsx": "Displays average progress and completion stats across all goals with loading and error states.",
  "frontend/src/pages/CreateGoalPage.tsx": "Renders a form for creating a new goal and submits it before navigating home.",
  "frontend/src/pages/GoalDetailPage.tsx": "Shows detailed goal info with edit and delete functionality, including loading and error handling.",
  "frontend/src/pages/GoalsDashboardPage.tsx": "Lists goals with status filtering, loading/error views, and an add-goal button.",
  "frontend/src/pages/LanguagesPage.tsx": "Empty placeholder page.",
  "frontend/src/pages/NotificationsPage.tsx": "Empty placeholder page.",
  "frontend/src/pages/ProfilePage.tsx": "Displays the user's profile info with loading and error handling using Internet Identity.",
  "frontend/src/pages/SettingsPage.tsx": "User settings page that loads the caller's profile, allows editing the display name with validation, and saves updates with success and error handling.",
  "frontend/src/pages/StatsPage.tsx": "Displays goal statistics by fetching all goals, showing counts and progress summaries, with loading and error states.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, persisting, and clearing URL and session-based parameters, including hash routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, typography, container settings, shadows, and animations.",
  "project_state.json": "JSON describing the project's state, features, and pending requests related to removing settings and adding a goal creation button."
}