{
  "backend/main.mo": "Motoko backend actor handling user profiles and CRUD operations for goals with access control enforcement and per-user goal storage.",
  "feature_evidence.json": "Lists implemented features with associated files, components, and test IDs for build verification.",
  "frontend-file-summaries.txt": "Provides short descriptions of multiple frontend files for reference or documentation.",
  "frontend/index.css": "Global Tailwind-based style definitions with light and dark theme CSS variables.",
  "frontend/index.html": "Base HTML file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up routing, authentication flow, and layout including profile setup handling.",
  "frontend/src/components/app/AppBottomNav.tsx": "Mobile bottom navigation with home and other route links, including active-state highlighting.",
  "frontend/src/components/app/AppNav.tsx": "Desktop navigation bar showing main app routes with active styling.",
  "frontend/src/components/app/AppShell.tsx": "App layout wrapper with header, footer, authenticated navigation, and content container.",
  "frontend/src/components/auth/AuthControls.tsx": "Authentication control component for signing in or out using Internet Identity with status handling.",
  "frontend/src/components/goals/GoalCard.tsx": "Displays a goal card with navigation, checkbox toggle, and swipe-to-complete interactions using React state and mutations.",
  "frontend/src/components/goals/GoalForm.tsx": "Renders a form to create or edit goals with validation, controlled inputs, and submit handling.",
  "frontend/src/components/profile/ProfileSetupModal.tsx": "Shows a modal prompting the user to enter and save their name via a profile mutation.",
  "frontend/src/components/state/EmptyGoalsState.tsx": "Displays an empty-state view encouraging users to create their first goal.",
  "frontend/src/components/state/LoadingState.tsx": "Provides skeleton loading components for lists and goal detail views.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an authentication context using Internet Identity, handling login, stored identities, and state management.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles and goals through the backend actor.",
  "frontend/src/index.css": "Defines Tailwind layers and CSS variables for light and dark themes with custom color palettes and base styles.",
  "frontend/src/lib/goals/types.ts": "Provides helpers for goal status labels and colors and exports the list of all statuses.",
  "frontend/src/lib/goals/validation.ts": "Includes simple validation functions for goal titles and progress values.",
  "frontend/src/lib/time.ts": "Utility functions for converting between bigint timestamps and Date objects and formatting them.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AveragesPage.tsx": "Fetches goals and displays average progress and completion statistics with loading and error states.",
  "frontend/src/pages/CreateGoalPage.tsx": "Renders a form to create a new goal and handles submission via mutation.",
  "frontend/src/pages/GoalDetailPage.tsx": "Shows goal details with edit and delete functionality, including loading and error handling.",
  "frontend/src/pages/GoalsDashboardPage.tsx": "Displays a filterable grid of goals with loading, empty, and error states.",
  "frontend/src/pages/LanguagesPage.tsx": "Placeholder page describing upcoming language selection features.",
  "frontend/src/pages/NotificationsPage.tsx": "Placeholder page outlining future notification preference settings.",
  "frontend/src/pages/ProfilePage.tsx": "Shows the user's profile info with loading and error states, including principal ID and name.",
  "frontend/src/pages/SettingsPage.tsx": "Provides a settings page allowing users to view and update their display name with validation, loading, and error states.",
  "frontend/src/pages/StatsPage.tsx": "Displays goal statistics with counts and progress, handling loading, error, and empty states.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL and session parameters, supporting hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, fonts, shadows, and components with plugin support.",
  "project_state.json": "Project metadata describing existing features, new requests, and project configuration state."
}