{
  "backend/main.mo": "Motoko backend implementing user access control and CRUD operations for goals and user profiles using map-based storage and authorization checks.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to corresponding frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of key frontend files including pages, components, hooks, and utilities.",
  "frontend/index.css": "Global Tailwind CSS configuration defining color tokens, theme variables, and base dark/light mode styles.",
  "frontend/index.html": "HTML entry point loading the React application root and main script.",
  "frontend/src/App.tsx": "Main React app defining authentication-aware layout and all routes for pages including goals, settings, profile, and new bottom-nav pages.",
  "frontend/src/components/app/AppBottomNav.tsx": "Mobile-only sticky bottom navigation bar with six route links and active highlighting.",
  "frontend/src/components/app/AppNav.tsx": "Desktop navigation bar showing links to core pages with active route styling.",
  "frontend/src/components/app/AppShell.tsx": "App layout wrapper providing header, footer, conditional bottom nav, and authenticated spacing for mobile navigation.",
  "frontend/src/components/auth/AuthControls.tsx": "Provides sign-in and sign-out controls using Internet Identity and displays the user's name when authenticated.",
  "frontend/src/components/goals/GoalCard.tsx": "Renders a clickable card showing a goal’s title, status, description, progress, and target date.",
  "frontend/src/components/goals/GoalForm.tsx": "Form for creating or editing goals with validation and submission handling.",
  "frontend/src/components/profile/ProfileSetupModal.tsx": "Modal prompting the user to enter and save their profile name on first use.",
  "frontend/src/components/state/EmptyGoalsState.tsx": "Displays an empty-state illustration and button to create the first goal.",
  "frontend/src/components/state/LoadingState.tsx": "Provides skeleton loading placeholders for goal lists and goal detail views.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for handling Internet Identity login, logout, and stored identity state.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating user profiles and goals through the backend actor.",
  "frontend/src/index.css": "Defines Tailwind layers and custom CSS variables for light and dark themes, plus base element styling.",
  "frontend/src/lib/goals/types.ts": "Provides status label/color helpers and exports all goal statuses.",
  "frontend/src/lib/goals/validation.ts": "Validates goal titles and progress values with simple rules.",
  "frontend/src/lib/time.ts": "Contains utilities for converting, formatting, and displaying bigint timestamp values.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AveragesPage.tsx": "Fetches goals and displays average progress and completion metrics with loading and error states.",
  "frontend/src/pages/CreateGoalPage.tsx": "Renders a goal creation form and submits new goals before navigating back.",
  "frontend/src/pages/GoalDetailPage.tsx": "Loads a single goal, supports updating and deleting it, and handles loading/error states.",
  "frontend/src/pages/GoalsDashboardPage.tsx": "Displays all goals with status filters, handling loading, empty, and error states.",
  "frontend/src/pages/LanguagesPage.tsx": "Shows a placeholder card for future language selection settings.",
  "frontend/src/pages/NotificationsPage.tsx": "Shows a placeholder card for upcoming notification preference settings.",
  "frontend/src/pages/ProfilePage.tsx": "Displays the user's profile info with loading and error handling.",
  "frontend/src/pages/SettingsPage.tsx": "Settings page that loads user profile, validates name input, and saves updates with success/error handling.",
  "frontend/src/pages/StatsPage.tsx": "Statistics page that loads all goals and displays counts and progress metrics with loading and error states.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL and session parameters, supporting hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, typography, animations, and content paths.",
  "project_state.json": "Project metadata describing current features, pending requests, navigation plans, and statistics requirements."
}