{
  "kind": "build_request",
  "title": "Add bottom navigation for Settings, Languages, Profile, Notifications, and Statistics/Averages",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a persistent bottom navigation bar (sticky at the bottom of the viewport) for authenticated users that provides one-tap navigation to: Settings, Languages, Profile, Notifications, Statistics, and Averages.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Je veux que tu mettes en bas les pages paramètre langues profils notifis , statistiques moyennes…"
        ]
      },
      "acceptanceCriteria": [
        "When the user is authenticated, a bottom navigation bar is visible on all app pages.",
        "Bottom navigation includes items labeled in English: \"Settings\", \"Languages\", \"Profile\", \"Notifications\", \"Statistics\", and \"Averages\".",
        "The currently active destination is visually highlighted based on the current route pathname.",
        "Navigation works without full page reload and uses the existing TanStack Router setup.",
        "Unauthenticated users do not see the bottom navigation."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add frontend routes and pages for Languages, Profile, Notifications, and Averages, and ensure each is reachable from the new bottom navigation bar.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Je veux que tu mettes en bas les pages paramètre langues profils notifis , statistiques moyennes…"
        ]
      },
      "acceptanceCriteria": [
        "New routes exist for Languages, Profile, Notifications, and Averages pages (in addition to existing /settings and /stats).",
        "Each new page renders a clear page title (English) matching the bottom-nav label.",
        "Each new page is accessible by clicking its bottom navigation item.",
        "Existing routes (/settings and /stats) continue to work as before."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update the layout spacing so page content is not hidden behind the new sticky bottom navigation bar.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Je veux que tu mettes en bas les pages paramètre langues profils notifis , statistiques moyennes…"
        ]
      },
      "acceptanceCriteria": [
        "On all pages, the main content area has sufficient bottom padding/margin so the bottom navigation does not overlap interactive content.",
        "This is verified on short pages (e.g., Settings) and long pages (e.g., Goals list) with scrolling."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui (shadcn components must be composed, not edited).",
    "Do not modify immutable hook files: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx.",
    "Backend must remain a single Motoko actor (no additional services)."
  ],
  "nonGoals": [
    "Implementing actual language switching/i18n behavior beyond adding a Languages page route and UI scaffold.",
    "Implementing notification delivery (push/SMS/email) or real-time messaging.",
    "Changing authentication provider (must remain Internet Identity)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}