{
  "kind": "build_request",
  "title": "Add Home button to bottom navigation and enable swipe/checkbox interactions on goals",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-4",
      "text": "Add a Home button (house icon) to the mobile bottom navigation that routes to the homepage ('/'), and ensure it uses the same active highlighting behavior as other bottom-nav items.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Faut qu’il y est un bouton maison pour la page d’accueil"
        ]
      },
      "acceptanceCriteria": [
        "On mobile, the bottom navigation shows a Home item that navigates to '/' when tapped.",
        "When the current route is '/', the Home item is styled as the active item (same active styling as other items).",
        "The bottom navigation remains a 1-row layout and does not overflow or wrap on common mobile widths."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Implement the requested interaction for goals: users must be able to either swipe/slide a goal card or use a checkbox control to mark a goal as completed/not completed directly from the goals list, without needing to open the goal detail page.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "et oublie pas le truc de faire glisser ou de cocher"
        ]
      },
      "acceptanceCriteria": [
        "Each goal in the goals dashboard list provides a visible checkbox (or equivalent check control) that toggles between Completed and Not Completed states.",
        "Toggling via the checkbox updates the goal via the existing update mutation and refreshes the goals list state (completed badge/status updates accordingly).",
        "On touch devices, each goal card supports a horizontal swipe/slide gesture that triggers the same complete/not-complete toggle (or reveals an action that performs the toggle).",
        "Using the checkbox or swipe action does not trigger navigation into the goal detail page (card click-to-open remains available elsewhere on the card).",
        "Error handling is present: if the update fails, the UI shows an error state/message and reverts the optimistic UI if applied."
      ]
    }
  ],
  "constraints": [
    "Use English for any user-facing UI text that is added/changed.",
    "Do not edit frontend immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Backend must remain a single Motoko actor in backend/main.mo; only add migration logic if state schema changes (avoid schema changes for this request)."
  ],
  "nonGoals": [
    "Do not implement drag-and-drop reordering of goals across the grid/list (only swipe/slide interaction for quick actions).",
    "Do not add new authentication providers (Internet Identity remains the only auth).",
    "Do not add new backend entities or external storage/databases."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}