{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Persistent authenticated bottom navigation + new routes/pages",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add a persistent sticky bottom navigation for authenticated users with links to Settings, Languages, Profile, Notifications, Statistics, and Averages, including active-route highlighting.",
      "acceptanceCriteria": [
        "When the user is authenticated, a bottom navigation bar is visible on all app pages.",
        "Bottom navigation includes items labeled in English: \"Settings\", \"Languages\", \"Profile\", \"Notifications\", \"Statistics\", and \"Averages\".",
        "The currently active destination is visually highlighted based on the current route pathname.",
        "Navigation works without full page reload and uses the existing TanStack Router setup.",
        "Unauthenticated users do not see the bottom navigation."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/app/AppBottomNav.tsx",
          "operation": "create",
          "description": "Create a new authenticated-only, sticky bottom navigation component using TanStack Router Link + useRouterState to render the required labeled destinations and apply active-route styling based on the current pathname. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/app/AppShell.tsx",
          "operation": "modify",
          "description": "Render the new AppBottomNav only when the user is authenticated, ensuring it is persistent across all routed pages (including existing goals, create, detail, stats, settings)."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add routes and scaffold pages for Languages, Profile, Notifications, and Averages and wire them to the bottom navigation.",
      "acceptanceCriteria": [
        "New routes exist for Languages, Profile, Notifications, and Averages pages (in addition to existing /settings and /stats).",
        "Each new page renders a clear page title (English) matching the bottom-nav label.",
        "Each new page is accessible by clicking its bottom navigation item.",
        "Existing routes (/settings and /stats) continue to work as before."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LanguagesPage.tsx",
          "operation": "create",
          "description": "Add a Languages page UI scaffold that renders a clear English title (\"Languages\") and placeholder content (no i18n behavior)."
        },
        {
          "path": "frontend/src/pages/ProfilePage.tsx",
          "operation": "create",
          "description": "Add a Profile page UI scaffold that renders a clear English title (\"Profile\") and basic placeholder content (do not introduce new auth flows)."
        },
        {
          "path": "frontend/src/pages/NotificationsPage.tsx",
          "operation": "create",
          "description": "Add a Notifications page UI scaffold that renders a clear English title (\"Notifications\") and placeholder content (no delivery/real-time implementation)."
        },
        {
          "path": "frontend/src/pages/AveragesPage.tsx",
          "operation": "create",
          "description": "Add an Averages page UI scaffold that renders a clear English title (\"Averages\") and simple placeholder/summary content (no changes to existing /stats behavior required)."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register new TanStack Router routes for /languages, /profile, /notifications, and /averages, importing the new pages and adding them to the route tree while keeping existing /settings and /stats routes unchanged."
        },
        {
          "path": "frontend/src/components/app/AppBottomNav.tsx",
          "operation": "modify",
          "description": "Wire bottom-nav items to the correct paths for Settings (/settings), Languages (/languages), Profile (/profile), Notifications (/notifications), Statistics (/stats), and Averages (/averages), ensuring each click navigates client-side without full reload. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Adjust layout spacing to prevent content from being overlapped by the sticky bottom navigation.",
      "acceptanceCriteria": [
        "On all pages, the main content area has sufficient bottom padding/margin so the bottom navigation does not overlap interactive content.",
        "This is verified on short pages (e.g., Settings) and long pages (e.g., Goals list) with scrolling."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/app/AppShell.tsx",
          "operation": "modify",
          "description": "Update the main content container styling to include conditional bottom padding/margin when authenticated so interactive content and scroll areas are not hidden behind the sticky bottom navigation."
        },
        {
          "path": "frontend/src/components/app/AppBottomNav.tsx",
          "operation": "modify",
          "description": "Ensure the bottom navigation uses fixed/sticky positioning at the bottom of the viewport with appropriate height so the AppShell can reserve space reliably. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}