{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Remove Languages/Notifications from navigation and add '+' create-goal button",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Remove Languages/Notifications from the mobile bottom navigation and ensure the layout adapts cleanly to fewer items.",
      "acceptanceCriteria": [
        "On mobile, the bottom navigation no longer shows 'Languages' or 'Notifications'.",
        "The bottom navigation layout adapts to the new number of items (no 7-column grid with empty space; spacing and touch targets remain consistent).",
        "No other navigation items are removed or renamed."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/app/AppBottomNav.tsx",
          "operation": "modify",
          "description": "Remove the '/languages' and '/notifications' nav items and their icons, and update the bottom-nav layout to be item-count adaptive (e.g., switch from a fixed 7-column grid to a flexible layout or an appropriate fixed column count matching the remaining items) so there are no empty columns or misalignment on mobile."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Remove the Languages and Notifications routes so the router no longer registers them.",
      "acceptanceCriteria": [
        "The router no longer defines routes for '/languages' and '/notifications'.",
        "Navigating to '/languages' or '/notifications' via manual URL entry does not render the removed placeholder pages (it should fall back to the router's default not-found/route-missing behavior).",
        "No other routes are impacted (e.g., '/', '/create', '/stats', '/settings', '/profile', '/averages' continue to work)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Remove imports and route registrations for LanguagesPage and NotificationsPage, and ensure the route tree no longer includes '/languages' or '/notifications' while keeping all other routes unchanged."
        },
        {
          "path": "frontend/src/pages/LanguagesPage.tsx",
          "operation": "delete",
          "description": "Delete the placeholder Languages page so it cannot be rendered by any remaining navigation or accidental imports."
        },
        {
          "path": "frontend/src/pages/NotificationsPage.tsx",
          "operation": "delete",
          "description": "Delete the placeholder Notifications page so it cannot be rendered by any remaining navigation or accidental imports."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add a visible '+' control on the goals dashboard that navigates to the existing '/create' goal creation flow.",
      "acceptanceCriteria": [
        "A '+' (plus) control is visible from the goals dashboard experience and is usable on mobile.",
        "Activating the '+' control navigates to '/create'.",
        "The existing Create Goal page and goal creation flow remain unchanged and continue to work."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/goals/AddGoalButton.tsx",
          "operation": "create",
          "description": "Create a reusable '+' add-goal control (e.g., a compact icon button or mobile-friendly floating action button) that navigates to '/create' when activated, using existing routing utilities and existing UI primitives (do not modify anything under frontend/src/components/ui)."
        },
        {
          "path": "frontend/src/pages/GoalsDashboardPage.tsx",
          "operation": "modify",
          "description": "Render the new AddGoalButton on the goals dashboard so it is clearly discoverable on mobile (including when the list is non-empty), and wire it to navigate to '/create' without changing the existing create-goal flow."
        }
      ]
    }
  ]
}